1s/ERP/extensions/liko/Documents/ВозвратСырьяОтПереработчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВозвратСырьяОтПереработчика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПодДеятельность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратПереданнойМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскийСчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПринялДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументРеализации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПередачаСырьяПереработчику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Лико_ПриходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/ВозвратСырьяОтПереработчика/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Лико_ЛикоПодборПоПриходныиОрдерамВместо(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Партнер",Объект.Партнер);
	Структура.Вставить("Склад",Объект.Склад);

	Массив=Новый Массив;
	Для каждого Товар Из Объект.Товары Цикл
		СтруктураТовар = Новый Структура;
		СтруктураТовар.Вставить("Номенклатура",Товар.Номенклатура);
		СтруктураТовар.Вставить("Характеристика",Товар.Характеристика);
		Массив.Добавить(СтруктураТовар);
	КонецЦикла;
	Структура.Вставить("НоменклатураДокумента", Массив);
	ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ЗаполнитьПоОрдерамПослеЗавершение",ЭтаФорма);
	ОткрытьФорму("Обработка.Лико_ЗаполнениеТЧПТУ.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  	
	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ТоварыЛико_ПриходныйОрдер" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",Элементы.Товары.ТекущиеДанные.Номенклатура);
		Структура.Вставить("Партнер",Объект.Партнер);
		Структура.Вставить("Склад",Объект.Склад);

		
		Структура.Вставить("Характеристика",Элементы.Товары.ТекущиеДанные.Характеристика);
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ТоварыВыборПослеЗавершение",ЭтаФорма);
		ОткрытьФорму("Обработка.Лико_ЗаполнениеТЧПТУ.Форма.Форма",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  	
		
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыВыборПослеЗавершение(ФормаРезультат,ФормаПараметры) Экспорт//+Лико m.shenderov 24.01.2018
	Если ЗначениеЗаполнено(ФормаРезультат) Тогда
		Элементы.Товары.ТекущиеДанные.Лико_ПриходныйОрдер=ФормаРезультат;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ЗаполнитьПоОрдерамПослеЗавершение(ФормаРезультат,ФормаПараметры) Экспорт//+Лико m.shenderov 24.01.2018
	
	Если ТипЗнч(ФормаРезультат)=Тип("Массив") Тогда
		Для каждого Товар Из ФормаРезультат  Цикл
			СтруктураПоискаСОрдером = Новый Структура;
			СтруктураПоиска = Новый Структура;
			СтруктураПоискаСОрдером.Вставить("Номенклатура",Товар.Номенклатура);
			СтруктураПоискаСОрдером.Вставить("Характеристика",Товар.Характеристика);
			СтруктураПоискаСОрдером.Вставить("Лико_ПриходныйОрдер",Товар.ПриходныйОрдер);
			
			СтруктураПоиска.Вставить("Номенклатура",Товар.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика",Товар.Характеристика);
			
			
			
			НайтиСтрокиСОрдером=Объект.Товары.НайтиСтроки(СтруктураПоискаСОрдером);
			Если НайтиСтрокиСОрдером.Количество()>0 Тогда
				Для каждого ТОварСОрдером Из НайтиСтрокиСОрдером Цикл
					
					ТОварСОрдером.Количество=Товар.Количество;
					ТОварСОрдером.КоличествоУпаковок=Товар.Количество;
					Элементы.Товары.ТекущаяСтрока=ТОварСОрдером.ПолучитьИдентификатор();
					ТоварыКоличествоУпаковокПриИзменении(Неопределено);	
					//ТоварыПриИзменении(Неопределено);
					
				КонецЦикла;
			Иначе
				НовыйТовар= Объект.Товары.Добавить();
				Элементы.Товары.ТекущаяСтрока=НовыйТовар.ПолучитьИдентификатор();
				НовыйТовар.Номенклатура=Товар.Номенклатура;
				ТоварыНоменклатураПриИзменении(Неопределено);
				НовыйТовар.Характеристика=Товар.Характеристика;
				НовыйТовар.Количество=Товар.Количество;
				НовыйТовар.КоличествоУпаковок=Товар.Количество;
				НовыйТовар.Лико_ПриходныйОрдер=Товар.ПриходныйОрдер;
				
				
				Цена=0;
				НайтиСтрокиСЦеной=Объект.Товары.НайтиСтроки(СтруктураПоиска);
				Для каждого ТоварСЦеной Из НайтиСтрокиСЦеной Цикл
					Если  ТоварСЦеной.Цена>0 Тогда  						
						НовыйТовар.Цена=ТоварСЦеной.Цена;
						Прервать;						
					КонецЕсли; 					
				КонецЦикла; 				
				ТоварыКоличествоУпаковокПриИзменении(Неопределено);				
				//ТоварыПриИзменении(Неопределено);
				
			КонецЕсли;
			
			
			
			
		КонецЦикла;
	КонецЕсли;	
//ОбновитьНарезкуТовара();	
КонецПроцедуры //-Лико m.shenderov 24.01.2018

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура Лико_УстановитьУсловноеОформление()
	
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Товары");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Лико_ПриходныйОрдер");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(205, 255, 205));
КонецПроцедуры
